# Рост дочерей 175, 167, 154, 174, 178, 148, 160, 167, 169, 170
# Рост матерей 178, 165, 165, 173, 168, 155, 160, 164, 178, 175
# Используя эти данные построить 95% доверительный интервал для разности среднего
# роста родителей и детей.

import numpy as np
from scipy import stats

v1 = np.array([175, 167, 154, 174, 178, 148, 160, 167, 169, 170])
v2 = np.array([178, 165, 165, 173, 168, 155, 160, 164, 178, 175])
n = len(v1)
x1 = np.mean(v1)
x2 = np.mean(v2)
delta = x1 - x2
d1 = np.var(v1, ddof=1)
d2 = np.var(v2, ddof=1)
d = (d1 + d2) / 2
sd = np.sqrt(d / n + d / n)
t = stats.t.ppf(0.975, 2 * (n - 1))
print(f'Доверительный интервал [{delta - t * sd} ; {delta + t * sd}]')

